Revit 2027 API
MEPNetworkIterator.CurrentElementId Property
 The element id at the current iteration step.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CurrentElementId { get; }
Public ReadOnly Property CurrentElementId As ElementId
	Get
public:
property ElementId^ CurrentElementId {
	ElementId^ get ();
}
member CurrentElementId : ElementId with get
Property Value
ElementId
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace